uhnp/src/DataProcessors/тн_ЗаполнитьУчетныеПБЗ/тн_ЗаполнитьУчетныеПБЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_ЗаполнитьУчетныеПБЗ</name>
  <comment>// Егоров Петр 19.01.2026 Выполнение задач №000056445</comment>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

uhnp/src/Enums/тн_РежимыВИнтеграционнойСхеме/тн_РежимыВИнтеграционнойСхеме.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>тн_РежимыВИнтеграционнойСхеме</name>
  <comment>Выполнение задач №000046497</comment>
  <enumValues>
    <name>Промежуточный</name>
  </enumValues>
  <enumValues>
    <name>Учетный</name>
  </enumValues>
  <enumValues>
    <name>Давальческий</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/DataProcessors/тн_ЗаполнитьУчетныеПБЗ/Forms/Форма/Module.bsl
#Область КомандыФормы

&НаКлиенте
Процедура ЗаполнитьУчетныеПБЗ(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ПоказатьПредупреждение(,"Не выбран период");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ПоказатьПредупреждение(,"Не выбрана Организация");
		Возврат;
	КонецЕсли;
	
	РезультатОбработки = ЗаполнитьУчетныеПБЗ_Сервер();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОбработки.ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьУчетныеПБЗ_Сервер()
	
	РезультатОбработки = Новый Структура("ЕстьОшибки, ТекстСообщения", Ложь, "");
	ТекстСообщения = СтрШаблон("Начало обработки: %1", ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала"		, Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"	, КонецДня(Объект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("Подразделение"	, Объект.Подразделение);
	Запрос.УстановитьПараметр("Продукция"		, Объект.Продукция);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыходныеИзделия.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ВыходныеИзделия
	|ГДЕ
	|	ВыходныеИзделия.Ссылка.тн_РежимВИнтеграционнойСхеме = ЗНАЧЕНИЕ(Перечисление.тн_РежимыВИнтеграционнойСхеме.Промежуточный)
	|	И НЕ ВыходныеИзделия.Ссылка.ПометкаУдаления
	|	И ВыходныеИзделия.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВыходныеИзделия.Ссылка.Организация = &Организация
	|	И ВыходныеИзделия.Подразделение = &Подразделение
	|	И ВыходныеИзделия.Номенклатура = &Продукция";
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВыходныеИзделия.Подразделение = &Подразделение", "");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Продукция) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВыходныеИзделия.Номенклатура = &Продукция", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КолПБЗ = Выборка.Количество();
	пп = 0;
	
	Пока Выборка.Следующий() Цикл
		пп = пп + 1;
		
		Отказ = Ложь;
		Результат = Новый Структура("Успех,ОписаниеОшибки", Истина, "");
		
		ОбъектПБЗ = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектПБЗ.ДополнительныеСвойства.Вставить("posted", Истина);
		
		Документы.ПроизводствоБезЗаказа.ЗаполнитьУчетныеДокументы(Отказ, Результат, ОбъектПБЗ);
		
		Если Результат.Успех = Ложь Тогда
			РезультатОбработки.ЕстьОшибки = Истина;
			ТекстСообщения = ТекстСообщения + СтрШаблон("%1 Ошибка при обработке: %2 - %3", Символы.ПС, СокрЛП(ОбъектПБЗ), Результат.ОписаниеОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстСообщения = ТекстСообщения + СтрШаблон("%1Обработано Промежуточных ПБЗ: %2", Символы.ПС, КолПБЗ);
	ТекстСообщения = ТекстСообщения + СтрШаблон("%1Окончание обработки: %2", Символы.ПС, ТекущаяДатаСеанса());
	
	РезультатОбработки.Вставить("ТекстСообщения", ТекстСообщения);
	
	Возврат РезультатОбработки;
	
КонецФункции

#КонецОбласти
